In [ ]:
import pandas as pd

In [ ]:
import pandas as pd

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
# Display the first few rows
print(df.head())

# Display the last few rows
print(df.tail())

# Summary of the DataFrame
print(df.info())

# Descriptive statistics
print(df.describe())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes
None
        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [ ]:
# Selecting a single column
print(df['Name'])

# Selecting multiple columns
print(df[['Name', 'Age']])

# Selecting rows by index
print(df.iloc[0])  # First row
print(df.iloc[1:3])  # Second and third rows

# Selecting rows by condition
print(df[df['Age'] > 30])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
Name       Alice
Age           25
City    New York
Name: 0, dtype: object
      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age     City
2  Charlie   35  Chicago

In [ ]:
import pandas as pd

# Create the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)

# Adding a new column
df['Salary'] = [50000, 60000, 70000]
print(df)

# Updating an existing column
df['Age'] = df['Age'] + 1
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
      Name  Age         City  Salary
0    Alice   26     New York   50000
1      Bob   31  Los Angeles   60000
2  Charlie   36      Chicago   70000

In [ ]:
# Removing a column
df = df.drop('Salary', axis=1)
print(df)

# Removing rows
df = df.drop(1)  # Remove the second row
print(df)

      Name  Age         City
0    Alice   26     New York
1      Bob   31  Los Angeles
2  Charlie   36      Chicago
      Name  Age      City
0    Alice   26  New York
2  Charlie   36   Chicago